#include <stdio.h>

/**
 * 将China翻译成密码，密码规律是：用原来的字母后面第4个代替原来的字母。
 * 例如：字符A后面第四个字母是E，用E代替A。因此China翻译为Glmre。
 * 编写程序，用赋初值得方法使c1-c5这5个变量的值分别为'C','h','i','n','a',经过计算，使c1-c5分别变成
 * 'G','l','m','r','e'并输出
 */

int main()
{
  char c1 = 'C', c2 = 'h', c3 = 'i', c4 = 'n', c5 = 'a';
  c1 += 4;
  c2 += 4;
  c3 += 4;
  c4 += 4;
  c5 += 4;
  printf("%c%c%c%c%c\n", c1, c2, c3, c4, c5);

  int z1, z2;
  z1 = 197;
  z2 = 198;
  printf("%c  %c,\n", z1, z2);
}

/**
 * 2.4 例2.3是否能改写？
 *
 * 2.4-1 输出a b  97 98 存储字符时会将字符转换成ASCII码，然后存在一字节中，输出时会将ASCII码
 * 转换成相应字符。按整数使直接将ASCII码作为整数输出
 * 2.4-2 输出空 空 197 198
 */